/**
 * Created by Administrator on 2015/4/25.
 */
    //定义mydata数组 , 用来分段返回值.
var myData = [] ;
//存储数据 , 包括内容为标题 , 图片地址名, 和简介 .
var myDataStr = "1.匆匆洛阳途<br>\
<br>\
------<br>\
洛阳城里见秋风<br>\
欲说还休意万重<br>\
路途匆匆难道尽<br>\
心中情意风中留<br>\
------匆匆洛阳<br>\
<br>\
<br>\
2.想你<br>\
<br>\
------<br>\
一辈子有多少的来不及<br>\
发现已经失去最重要的东西<br>\
恍然大悟早已远去<br>\
------思念是一种病<br>\
<br>\
<br>\
3.MM<br>\
<br>\
------<br>\
你有你的选择<br>\
我有我的执着<br>\
我们都抗拒着青春腐朽<br>\
------<br>\
<br>\
<br>\
4.苗苗<br>\
<br>\
------<br>\
请记住:<br>\
生命不息<br>\
奋斗不止<br>\
-------<br>\
<br>\
<br>\
5.汉字间的爱情风趣表白<br>\
<br>\
--------------<br>\
囚对人说：你是我心中的最爱<br>\
人对囚说：<br>\
拉倒吧，和囚犯相爱<br>\
我脑子有病啊，<br>\
还是等你从监狱里出来看表现再说吧。<br>\
--------------<br>\
<br>\
<br>\
6.小笑话<br>\
<br>\
-----------------------<br>\
悬崖上一小老鼠挥舞着短短的前爪<br>\
一次又一次跳下去努力学习飞翔<br>\
旁边母蝙蝠看着它摔的头破血流<br>\
忧心的说：<br>\
它爹，要不告诉它<br>\
它不是咱亲生的<br>\
-----------------------<br>\
<br>\
<br>\
7.青春<br>\
<br>\
------------<br>\
我们都在谈论着青春<br>\
却在青春里慢慢老去<br>\
这一生<br>\
能否遇到一个值得付出的人<br>\
青春不老<br>\
我依旧在<br>\
-------------<br>\
<br>\
<br>\
8.喂110我要报警<br>\
<br>\
----------------<br>\
“110吗？我要报警！<br>\
这里有人老是踢我！！！<br>\
“好的，不要着急，<br>\
我们马上派人过去，请问你在哪里？<br>\
“斗地主电信专区86号房47桌。<br>\
----------------<br>\
"
//定义函数分割myData数据 , myData接收分好组的数据 :以三个连续的<br>\标记为分界

var d = myDataStr.split("<br><br><br>");   //以三个br分出不同大主题
for(var i=0 ;i< d.length;i++){
    var c = d[i].split("<br><br>");
    myData.push(
        {
            img:c[0].replace('.',"")+".jpg",
            caption:c[0].split('.')[1],
            desc:c[1]
        }
    )
}

